Revit 2026 API
Element.BoundingBox Property
Retrieves a box that circumscribes all geometry of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public BoundingBoxXYZ this[
	View A_0
] { get; }
Public ReadOnly Property BoundingBox (
	A_0 As View
) As BoundingBoxXYZ
	Get
public:
property BoundingBoxXYZ^ BoundingBox[View^ A_0] {
	BoundingBoxXYZ^ get (View^ A_0);
}
member BoundingBox : BoundingBoxXYZ with get
Parameters
A_0 View
Property Value
BoundingBoxXYZ
Remarks
Pass in a view to query view-specific (e.g., cut) geometry or null for model geometry. If the view box is not known or cannot be calculated, this will return the model box; if the model box is not known, this will return null. The box will always be aligned to the default axes of the model coordinate system (thus no rotation should be applied to the return value). Also note that this bounding box volume may enclose geometry that is not obvious. For example, the "flip controls" that could be part of a family will be included in the computation of the bounding box even though they are not always visible in the family instance of the family.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace